{
    "data": {
        "processing_time": {
            "form_info_en": "Consideration of Deferred Action for Childhood Arrivals",
            "form_info_es": "Consideración de Acción Diferida para los Llegados en la Infancia",
            "form_name": "I-821D",
            "form_note_en": null,
            "form_note_es": null,
            "office_code": "CSC",
            "pilot_content_en": "This processing time is based on how long it took us to process 80% of cases over the past six months. Each case is unique, and some cases may take longer than others. Processing times should be used as a reference point, not an absolute measure of how long your case will take to be completed.",
            "pilot_content_es": "Este tiempo de procesamiento está basado en cuánto nos tomó procesar 80% de los casos durante los pasados seis meses. Cada caso es único y algunos casos podrían tomar más tiempo que otros. Los tiempos de procesamiento deben ser utilizados como puntos de referencia y no como una medida absoluta de cuánto tomará su caso en completarse.",
            "pilot_form": true,
            "range": null,
            "subtypes": [
                {
                    "form_type": "149-ECA",
                    "publication_date": "March 14, 2022",
                    "range": [
                        {
                            "unit": "",
                            "unit_en": "learn more.",
                            "unit_es": "\n                continuación para obtener más información.",
                            "value": ""
                        },
                        {
                            "unit": "",
                            "unit_en": "See below",
                            "unit_es": "Vea",
                            "value": ""
                        }
                    ],
                    "service_request_date": "",
                    "service_request_date_en": "",
                    "service_request_date_es": "",
                    "subtype_info_en": "Request for Deferred Action",
                    "subtype_info_es": "Solicitud para Acción Diferida",
                    "subtype_note_en": "Consistent with the July 16, 2021, order from the Southern District of Texas that prohibits DHS from granting initial DACA requests, USCIS has suspended calculations of processing times for initial DACA requests. https://www.uscis.gov/DACADecisionStateofTexas",
                    "subtype_note_es": "Si su caso ha estado pendiente más de 105 días, puede enviar una solicitud de información sobre \"caso fuera del tiempo de procesamiento normal\" en línea. El Formulario I-821D no aparece en las opciones de menú. Por favor, utilice su número de recibo I-765 para enviar la solicitud. https://www.uscis.gov/DACADecisionStateofTexas"
                }
            ]
        }
    },
    "message": "Query was successful for payload {'form_name': 'I-821D', 'office_code': 'CSC'}"
}