{
    "data": {
        "processing_time": {
            "form_info_en": "Petition for U Nonimmigrant Status",
            "form_info_es": "Solicitud de Estatus U de No Inmigrante",
            "form_name": "I-918",
            "form_note_en": null,
            "form_note_es": null,
            "office_code": "ESC",
            "pilot_content_en": "This processing time is based on how long it took us to process 80% of cases over the past six months. Each case is unique, and some cases may take longer than others. Processing times should be used as a reference point, not an absolute measure of how long your case will take to be completed.",
            "pilot_content_es": "Este tiempo de procesamiento está basado en cuánto nos tomó procesar 80% de los casos durante los pasados seis meses. Cada caso es único y algunos casos podrían tomar más tiempo que otros. Los tiempos de procesamiento deben ser utilizados como puntos de referencia y no como una medida absoluta de cuánto tomará su caso en completarse.",
            "pilot_form": true,
            "range": [
                {
                    "unit": "Months",
                    "unit_en": "Months",
                    "unit_es": "Meses",
                    "value": 63.5
                },
                {
                    "unit": "Months",
                    "unit_en": "Months",
                    "unit_es": "Meses",
                    "value": 59.5
                }
            ],
            "subtypes": [
                {
                    "form_type": "918ABFD",
                    "publication_date": "March 29, 2022",
                    "range": [
                        {
                            "unit": "Months",
                            "unit_en": "Months",
                            "unit_es": "Meses",
                            "value": 63.5
                        },
                        {
                            "unit": "Months",
                            "unit_en": "Months",
                            "unit_es": "Meses",
                            "value": 59.5
                        }
                    ],
                    "service_request_date": "December 28, 2016",
                    "service_request_date_en": "December 28, 2016",
                    "service_request_date_es": "28 de diciembre de 2016",
                    "subtype_info_en": "Petition for a noncitizen who is a victim of qualifying criminal activity, and their qualifying family members (Time from Initial Filing to Bona Fide Determination (BFD) Review)",
                    "subtype_info_es": "Petición para un no ciudadano que es una víctima de una actividad criminal cualificada y sus familiares elegibles (Tiempo para una Presentación Inicial de Evaluación de Determinación de Autenticidad (BFD))",
                    "subtype_note_en": "The above time range reflects the time from receipt to issuance of either a BFD notice or a notice that the petition will be considered for waiting list placement. It does not reflect the current processing times from initial receipt to the final issuance of U nonimmigrant status. If you have not already submitted your Form I-765 with your initial Petition for U nonimmigrant status, please file the Form I-765 according to the posted date on the Form I-918 page.",
                    "subtype_note_es": "El rango de tiempo anterior refleja el tiempo desde que se recibe la petición hasta la emisión de una notificación de BFD o una notificación de que la petición será considerada para la colocación en la lista de espera. No refleja los tiempos de procesamiento actuales desde el recibo inicial hasta la emisión final del estatus de no inmigrante U. Si aún no ha presentado su Formulario I-765 con su Petición inicial para el estatus de no inmigrante U, presente el Formulario I-765 de acuerdo con la fecha publicada en la página del Formulario I-918."
                }
            ]
        }
    },
    "message": "Query was successful for payload {'form_name': 'I-918', 'office_code': 'ESC'}"
}