{
    "data": {
        "processing_time": {
            "form_info_en": "Application for Waiver of the Foreign Residence Requirement (under Section 212(e) of the Immigration and Nationality Act, as Amended)",
            "form_info_es": "Solicitud de Exención del Requisito de Residencia en el Extranjero (bajo la Sección 212(e) de la  Ley de Inmigración y Nacionalidad, según enmendada)",
            "form_name": "I-612",
            "form_note_en": null,
            "form_note_es": null,
            "office_code": "CSC",
            "pilot_content_en": "This processing time is an estimate of how long it will take us to process your case based on the number of pending cases we have. Each case is unique, and some cases may take longer than others. Processing times should be used as a reference point, not an absolute measure of how long your case will take to be completed.",
            "pilot_content_es": "Este tiempo de procesamiento es un estimado de cuánto nos tomará procesar su caso a base la cantidad de casos pendientes que tenemos. Cada caso es único y algunos casos podrían tomar más tiempo que otros. Los tiempos de procesamiento deben ser utilizados como puntos de referencia y no como una medida absoluta de cuánto tomará su caso en completarse.",
            "pilot_form": false,
            "range": null,
            "subtypes": [
                {
                    "form_type": "144A",
                    "publication_date": "March 29, 2022",
                    "range": [
                        {
                            "unit": "Months",
                            "unit_en": "Months",
                            "unit_es": "Meses",
                            "value": 6
                        },
                        {
                            "unit": "Months",
                            "unit_en": "Months",
                            "unit_es": "Meses",
                            "value": 4
                        }
                    ],
                    "service_request_date": "October 13, 2021",
                    "service_request_date_en": "October 13, 2021",
                    "service_request_date_es": "13 de octubre de 2021",
                    "subtype_info_en": "Application for a waiver of the 2-year foreign residence requirement based on exceptional hardship or persecution",
                    "subtype_info_es": "Solicitud de Exoneración del requisito de dos años de residencia en el extranjero basada en dificultades o la persecución excepcional",
                    "subtype_note_en": "For Form I-612, Application for Waiver of the Foreign Residence Requirement, the Vermont Service Center processes only No Objection, Interested Government Agency, and Conrad cases. The California Service Center processes all other Form I-612 applications, including cases of exceptional hardship and cases of persecution.",
                    "subtype_note_es": "En casos del Formulario I-612, Solicitud de Exenci√≥n del Requisito de Residencia en el Extranjero, el Centro de Servicio de Vermont procesa solamente los casos de no objeci√≥n, agencia gubernamental interesada y casos Conrad. El Centro de Servicio de California procesa todas las dem√°s solicitudes del Formulario I-612, incluso casos de dificultades extremas y casos de persecuci√≥n."
                }
            ]
        }
    },
    "message": "Query was successful for payload {'form_name': 'I-612', 'office_code': 'CSC'}"
}